# About This Notebook
In this **Introduction to pandas** chapter, we will learn:
- How pandas and NumPy combine to make working with data easier.
- About the two core pandas types: series and dataframes.
- How to select data from pandas objects using axis labels.
***
## 1. Understanding Pandas and NumPy

The pandas library provides solutions to a lot of problems. However, pandas is not so much a replacement for NumPy but serves more as an extension of NumPy. Pandas uses the the NumPy library extensively, and you will notice this more when you dig deeper into the concept.

The primary data structure in pandas is called a **dataframe**. 
This is the pandas equivalent of a Numpy 2D ndarray but with some key differences:

> Axis values can have string **labels**, not just numeric ones. This means that the columns can now have their own meaningful names.

> Dataframes can contain columns with **multiple data types**: including ``integer``, ``float``, and ``string``. This enables us to store, for example, strings and integers in one dataframe.

## 2. Introduction to the Data
In this chapter, we will work with a data set from Fortune magazine's 2017 Global 500 list.

The data set is stored in a CSV file called **f500.csv**. Here is a data dictionary for some of the columns in the CSV:

- **company**: Name of the company.
- **rank**: Global 500 rank for the company.
- **revenues**: Company's total revenue for the fiscal year, in millions of dollars (USD).
- **revenue_change**: Percentage change in revenue between the current and prior fiscal year.
- **profits**: Net income for the fiscal year, in millions of dollars (USD).
- **ceo**: Company's Chief Executive Officer.
- **industry**: Industry in which the company operates.
- **sector**: Sector in which the company operates.
- **previous_rank**: Global 500 rank for the company for the prior year.
- **country**: Country in which the company is headquartered.

After getting to know our data set, how do we actually import pandas library in Python?
To import pandas, we simply type in the following code:

````python
import pandas as pd
````

Pandas' dataframes have a `.shape` attribute which returns a tuple representing the dimensions of each axis of the object. Now we want to use this and Python's `type()` function to take a closer look at the `f500` dataframe.

### Task 3.3.2:

1. Use Python's `type()` function to assign the type of `f500` to `f500_type`.
2. Use the `DataFrame.shape` attribute to assign the shape of `f500` to `f500_shape`.
3. Print both the `f500_type` and `f500_shape`.

In [1]:
import pandas as pd
f500 = pd.read_csv('../../../Data/csv/f500.csv',index_col=0)
f500.index.name = None
# Start your code below:

f500_type = type(f500)
f500_shape = f500.shape

print(f500_type, f500_shape)

<class 'pandas.core.frame.DataFrame'> (500, 16)

## 3. Introducing DataFrames

Remember how we spent so much time in the course "Be Around of Data Science" talking about rectangular data structures? Moreover, we discussed flat tables consisting of rows (observations) and columns (features)? Now this will come in really handy! 

I want to show you the `DataFrame.head` method. By default, it will return the first five rows of our dataframe. However, it also accepts an optional integer parameter, which specifies the number of rows:

In [2]:
f500.head(3)

,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
Walmart,1,485873,0.8,13643.0,198825,-7.2,C. Douglas McMillon,General Merchandisers,Retailing,1,USA,"Bentonville, AR",http://www.walmart.com,23,2300000,77798
State Grid,2,315199,-4.4,9571.3,489838,-6.2,Kou Wei,Utilities,Energy,2,China,"Beijing, China",http://www.sgcc.com.cn,17,926067,209456
Sinopec Group,3,267518,-9.1,1257.9,310726,-65.0,Wang Yupu,Petroleum Refining,Energy,4,China,"Beijing, China",http://www.sinopec.com,19,713288,106523

There is also the `DataFrame.tail` method to show us the last rows of our dataframe:

In [3]:
f500.tail(3)

,rank,revenues,revenue_change,profits,assets,profit_change,ceo,industry,sector,previous_rank,country,hq_location,website,years_on_global_500_list,employees,total_stockholder_equity
Wm. Morrison Supermarkets,498,21741,-11.3,406.4,11630,20.4,David T. Potts,Food and Drug Stores,Food & Drug Stores,437,Britain,"Bradford, Britain",http://www.morrisons.com,13,77210,5111
TUI,499,21655,-5.5,1151.7,16247,195.5,Friedrich Joussen,Travel Services,Business Services,467,Germany,"Hanover, Germany",http://www.tuigroup.com,23,66779,3006
AutoNation,500,21609,3.6,430.5,10060,-2.7,Michael J. Jackson,Specialty Retailers,Retailing,0,USA,"Fort Lauderdale, FL",http://www.autonation.com,12,26000,2310

### Task 3.3.3:

1. Use the `head()` method to select the **first 6 rows**. Assign the result to `f500_head`.
2. Use the `tail()` method to select the **last 8 rows**. Assign the result to `f500_tail`.

In [4]:
# Start your code here:

f500_head = f500.head(6)
f500_tail = f500.tail(8)

## 4. Introducting DataFrames Continued

Now let's talk about the `DataFrame.dtypes` attribute. The `DataFrame.dtypes` attribute returns information about the types of each column.

In [5]:
print(f500.dtypes)

rank                          int64
revenues                      int64
revenue_change              float64
profits                     float64
assets                        int64
profit_change               float64
ceo                          object
industry                     object
sector                       object
previous_rank                 int64
country                      object
hq_location                  object
website                      object
years_on_global_500_list      int64
employees                     int64
total_stockholder_equity      int64
dtype: object

To see a comprehensive overview of all the dtypes used in our dataframe, as well its shape and other information, we should use the `DataFrame.info()` [method](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.info.html). Remember that `DataFrame.info()` only prints the information, instead of returning it, so we can't assign it to a variable.

### Task 3.3.4:

1. Use the `DataFrame.info()` method to display information about the `f500` dataframe.

In [6]:
# Start your code below:

f500.info()

<class 'pandas.core.frame.DataFrame'>
Index: 500 entries, Walmart to AutoNation
Data columns (total 16 columns):
 #   Column                    Non-Null Count  Dtype
---  ------                    --------------  -----
 0   rank                      500 non-null    int64
 1   revenues                  500 non-null    int64
 2   revenue_change            498 non-null    float64
 3   profits                   499 non-null    float64
 4   assets                    500 non-null    int64
 5   profit_change             436 non-null    float64
 6   ceo                       500 non-null    object
 7   industry                  500 non-null    object
 8   sector                    500 non-null    object
 9   previous_rank             500 non-null    int64
 10  country                   500 non-null    object
 11  hq_location               500 non-null    object
 12  website                   500 non-null    object
 13  years_on_global_500_list  500 non-null    int64
 14  employees                 500 non-null    int64
 15  total_stockholder_equity  500 non-null    int64
dtypes: float64(3), int64(7), object(6)
memory usage: 66.4+ KB

## 5. Selecting a Column From a DataFrame by Label (IMPORTANT)

Do you know that our axes in pandas all have labels and we can select data using just those labels? The **DataFrame.loc[]** attribute is exactly the syntax designed for this purpose:

````python
df.loc[row_label, column_label]
````

Pay close attention that we use brackets ``[]`` instead of parentheses ``()`` when selecting by location.

Now let's look at an example:

In [7]:
f500.loc[:,"rank"]

Walmart                             1
State Grid                          2
Sinopec Group                       3
China National Petroleum            4
Toyota Motor                        5
                                 ...
Teva Pharmaceutical Industries    496
New China Life Insurance          497
Wm. Morrison Supermarkets         498
TUI                               499
AutoNation                        500
Name: rank, Length: 500, dtype: int64

Notice we used `:` to specify that all rows should be selected. And also pay attention that the new dataframe has the same row labels as the original.

The following shortcut can also be used to select a single column:

In [8]:
rank_col = f500["rank"]
print(rank_col)

Walmart                             1
State Grid                          2
Sinopec Group                       3
China National Petroleum            4
Toyota Motor                        5
                                 ...
Teva Pharmaceutical Industries    496
New China Life Insurance          497
Wm. Morrison Supermarkets         498
TUI                               499
AutoNation                        500
Name: rank, Length: 500, dtype: int64

### Task 3.3.5:

1. Select the `industry` column. Assign the result to the variable name `industries`.
2. Use Python's `type()` function to assign the type of `industries` to `industries_type`.

In [9]:
# Start your code below:

industries = f500["industry"]
industries_type = type(industries)
print(industries_type)

<class 'pandas.core.series.Series'>

## 6. Selecting Columns From a DataFrame by Label Continued
Below, we use a list of labels to select specific columns:

In [10]:
f500.loc[:,["country", "rank"]]

                                country  rank
Walmart                             USA     1
State Grid                        China     2
Sinopec Group                     China     3
China National Petroleum          China     4
Toyota Motor                      Japan     5
...                                 ...   ...
Teva Pharmaceutical Industries   Israel   496
New China Life Insurance          China   497
Wm. Morrison Supermarkets       Britain   498
TUI                             Germany   499
AutoNation                          USA   500

[500 rows x 2 columns]

In [11]:
f500[["country","rank"]]

                                country  rank
Walmart                             USA     1
State Grid                        China     2
Sinopec Group                     China     3
China National Petroleum          China     4
Toyota Motor                      Japan     5
...                                 ...   ...
Teva Pharmaceutical Industries   Israel   496
New China Life Insurance          China   497
Wm. Morrison Supermarkets       Britain   498
TUI                             Germany   499
AutoNation                          USA   500

[500 rows x 2 columns]

The code `f500.loc[:,["country", "rank"]]` and `f500[["country","rank"]]` eventually return us the same result.

You see that the object returned is two-dimensional, we know it's a dataframe, not a series. So instead of `df.loc[:,["col1","col2"]]`, we can also use `df[["col1", "col2"]]` to select specific columns.

Last but not least, let's finish by using **a slice object with labels** to select specific columns:

In [12]:
f500.loc[:,"rank":"profits"]

                                rank  revenues  revenue_change  profits
Walmart                            1    485873             0.8  13643.0
State Grid                         2    315199            -4.4   9571.3
Sinopec Group                      3    267518            -9.1   1257.9
China National Petroleum           4    262573           -12.3   1867.5
Toyota Motor                       5    254694             7.7  16899.3
...                              ...       ...             ...      ...
Teva Pharmaceutical Industries   496     21903            11.5    329.0
New China Life Insurance         497     21796           -13.3    743.9
Wm. Morrison Supermarkets        498     21741           -11.3    406.4
TUI                              499     21655            -5.5   1151.7
AutoNation                       500     21609             3.6    430.5

[500 rows x 4 columns]

The result is again a dataframe object with all of the columns from the first up until the last column in our slice. Unfortunately, there is no shortcut for selecting column slices.

See the table below for a short summary of techniques that we have just encountered:

|Select by Label|Explicit Syntax|Common Shorthand|
|--|--|--|
|Single column|df.loc[:,"col1"]|df["col1"]|
|List of columns|df.loc[:,["col1", "col7"]]|df[["col1", "col7"]]|
|Slice of columns|df.loc[:,"col1":"col4"]|

### Task 3.3.6:

1. Select the `country` column. Assign the result to the variable name `countries`.
2. In order, select the `revenues` and `years_on_global_500_list` columns. Assign the result to the variable name `revenues_years`.
3. In order, select all columns from `ceo` up to and including `sector`. Assign the result to the variable name `ceo_to_sector`.

In [13]:
# Start your code below:

countries = f500["country"]
revenues_years = f500[["revenues","years_on_global_500_list"]]
ceo_to_sector = f500.loc[:,"ceo":"sector"]

## 7. Selecting Rows From a DataFrame by Label

Now, let's learn how to use the labels of the index axis to select rows.

We can use the same syntax to select rows from a dataframe as we already have done for columns:

````python
df.loc[row_label, column_label]
````

#### To select a single row:

In [14]:
single_row = f500.loc["Sinopec Group"]
print(type(single_row))
print(single_row)

<class 'pandas.core.series.Series'>
rank                                             3
revenues                                    267518
revenue_change                                -9.1
profits                                     1257.9
assets                                      310726
profit_change                                -65.0
ceo                                      Wang Yupu
industry                        Petroleum Refining
sector                                      Energy
previous_rank                                    4
country                                      China
hq_location                         Beijing, China
website                     http://www.sinopec.com
years_on_global_500_list                        19
employees                                   713288
total_stockholder_equity                    106523
Name: Sinopec Group, dtype: object

A **series** is returned because it is one-dimensional. 
> In short, ``series`` is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). 
There are many data types that may need to be stored in this series, like integer, float, and string values, so pandas uses the **object** dtype, since none of the numeric types could cater for all values.

**To select a list of rows:**

In [15]:
list_rows = f500.loc[["Toyota Motor", "Walmart"]]
print(type(list_rows))
print(list_rows)

<class 'pandas.core.frame.DataFrame'>
              rank  revenues  revenue_change  profits  assets  profit_change  \
Toyota Motor     5    254694             7.7  16899.3  437575          -12.3
Walmart          1    485873             0.8  13643.0  198825           -7.2

                              ceo                  industry  \
Toyota Motor          Akio Toyoda  Motor Vehicles and Parts
Walmart       C. Douglas McMillon     General Merchandisers

                              sector  previous_rank country      hq_location  \
Toyota Motor  Motor Vehicles & Parts              8   Japan    Toyota, Japan
Walmart                    Retailing              1     USA  Bentonville, AR

                                   website  years_on_global_500_list  \
Toyota Motor  http://www.toyota-global.com                        23
Walmart             http://www.walmart.com                        23

              employees  total_stockholder_equity
Toyota Motor     364445                    157210
Walmart         2300000                     77798

**To select a slice object with labels:**

For selection using slices, a shortcut can be used like below. This is the reason we can't use this shortcut for columns – because it's reserved for use with rows:

In [16]:
slice_rows = f500["State Grid":"Toyota Motor"]
print(type(slice_rows))
print(slice_rows)

<class 'pandas.core.frame.DataFrame'>
                          rank  revenues  revenue_change  profits  assets  \
State Grid                   2    315199            -4.4   9571.3  489838
Sinopec Group                3    267518            -9.1   1257.9  310726
China National Petroleum     4    262573           -12.3   1867.5  585619
Toyota Motor                 5    254694             7.7  16899.3  437575

                          profit_change            ceo  \
State Grid                         -6.2        Kou Wei
Sinopec Group                     -65.0      Wang Yupu
China National Petroleum          -73.7  Zhang Jianhua
Toyota Motor                      -12.3    Akio Toyoda

                                          industry                  sector  \
State Grid                               Utilities                  Energy
Sinopec Group                   Petroleum Refining                  Energy
China National Petroleum        Petroleum Refining                  Energy
Toyota Motor              Motor Vehicles and Parts  Motor Vehicles & Parts

                          previous_rank country     hq_location  \
State Grid                            2   China  Beijing, China
Sinopec Group                         4   China  Beijing, China
China National Petroleum              3   China  Beijing, China
Toyota Motor                          8   Japan   Toyota, Japan

                                               website  \
State Grid                      http://www.sgcc.com.cn
Sinopec Group                   http://www.sinopec.com
China National Petroleum        http://www.cnpc.com.cn
Toyota Motor              http://www.toyota-global.com

                          years_on_global_500_list  employees  \
State Grid                                      17     926067
Sinopec Group                                   19     713288
China National Petroleum                        17    1512048
Toyota Motor                                    23     364445

                          total_stockholder_equity
State Grid                                  209456
Sinopec Group                               106523
China National Petroleum                    301893
Toyota Motor                                157210

### Task 3.3.7: 

By selecting data from `f500`:
1. Create a new variable `toyota`, with:
    - Just the row with index `Toyota Motor`.
    - All columns.
2. Create a new variable, `drink_companies`, with:
    - Rows with indicies `Anheuser-Busch InBev, Coca-Cola, and Heineken Holding`, in that order.
    - All columns.
3. Create a new variable, `middle_companies` with:
    - All rows with indicies from `Tata Motors` to `Nationwide`, inclusive.
    - All columns from `rank` to `country`, inclusive.

In [17]:
# Start your code below:

toyota = f500.loc['Toyota Motor',]
drink_companies = f500.loc[["Anheuser-Busch InBev", "Coca-Cola", "Heineken Holding"]]
middle_companies = f500.loc["Tata Motors":"Nationwide", "rank":"country"]

## 8. Value Counts Method

We understand that **series** and **dataframes** are two distinct objects. They each have their own unique methods.

First, let's select just one column from the ``f500`` dataframe:

In [18]:
sectors = f500["sector"]
print(type(sectors))

<class 'pandas.core.series.Series'>

Now, we want to substitute ``Series`` in `Series.value_counts()` with the name of our `sectors` series, like this:

In [19]:
sectors_value_counts = sectors.value_counts()
print(sectors_value_counts)

Financials                       118
Energy                            80
Technology                        44
Motor Vehicles & Parts            34
Wholesalers                       28
Health Care                       27
Food & Drug Stores                20
Transportation                    19
Telecommunications                18
Retailing                         17
Food, Beverages & Tobacco         16
Materials                         16
Industrials                       15
Aerospace & Defense               14
Engineering & Construction        13
Chemicals                          7
Household Products                 3
Media                              3
Hotels, Restaurants & Leisure      3
Business Services                  3
Apparel                            2
Name: sector, dtype: int64

You see that each unique non-null value is being counted and listed in the output above.

Well, what happens when we try to use the `Series.value_counts()` method with a dataframe? First step, we should select the `sector` and `industry` columns to create a dataframe named `sectors_industries`, like this:

In [20]:
sectors_industries = f500[["sector", "industry"]]
print(type(sectors_industries))

<class 'pandas.core.frame.DataFrame'>

Then, we'll try to use the `value_counts()` method:

In [21]:
si_value_counts = sectors_industries.value_counts()
print(si_value_counts)

sector                         industry
Financials                     Banks: Commercial and Savings                     51
Motor Vehicles & Parts         Motor Vehicles and Parts                          34
Energy                         Petroleum Refining                                28
Financials                     Insurance: Life, Health (stock)                   24
Food & Drug Stores             Food and Drug Stores                              20
Energy                         Mining, Crude-Oil Production                      18
Financials                     Insurance: Property and Casualty (Stock)          18
Telecommunications             Telecommunications                                18
Energy                         Utilities                                         18
Wholesalers                    Trading                                           15
Health Care                    Pharmaceuticals                                   15
Aerospace & Defense            Aerospace and Defense                             14
Engineering & Construction     Engineering, Construction                         13
Technology                     Electronics, Electrical Equip.                    13
Energy                         Energy                                            12
Materials                      Metals                                            12
Retailing                      Specialty Retailers                               10
Industrials                    Industrial Machinery                              10
Financials                     Insurance: Life, Health (Mutual)                   9
Technology                     Computers, Office Equipment                        8
Transportation                 Airlines                                           8
Financials                     Diversified Financials                             8
Food, Beverages & Tobacco      Food Production                                    7
Retailing                      General Merchandisers                              7
Chemicals                      Chemicals                                          7
Technology                     Internet Services and Retailing                    6
Transportation                 Mail, Package, and Freight Delivery                6
Wholesalers                    Wholesalers: Health Care                           6
Financials                     Real estate                                        6
Health Care                    Health Care: Insurance and Managed Care            6
Technology                     Semiconductors and Other Electronic Components     5
                               Information Technology Services                    5
Food, Beverages & Tobacco      Food Consumer Products                             5
Materials                      Building Materials, Glass                          4
Technology                     Network and Other Communications Equipment         4
                               Computer Software                                  3
Wholesalers                    Wholesalers: Food and Grocery                      3
                               Wholesalers: Electronics and Office Equipment      3
Transportation                 Railroads                                          3
Energy                         Pipelines                                          3
Food, Beverages & Tobacco      Beverages                                          3
Hotels, Restaurants & Leisure  Food Services                                      3
Media                          Entertainment                                      3
Household Products             Household and Personal Products                    3
Apparel                        Apparel                                            2
Financials                     Insurance: Property and Casualty (Mutual)          2
Health Care                    Health Care: Medical Facilities                    2
Industrials                    Textiles                                           2
Health Care                    Health Care: Pharmacy and Other Services           2
Transportation                 Shipping                                           2
Business Services              Temporary Help                                     2
Industrials                    Construction and Farm Machinery                    2
Health Care                    Medical Products and Equipment                     2
Food, Beverages & Tobacco      Tobacco                                            1
Industrials                    Miscellaneous                                      1
Energy                         Oil & Gas Equipment Services                       1
Business Services              Travel Services                                    1
Wholesalers                    Wholesalers: Diversified                           1
dtype: int64

We see that we have got the following error:

> AttributeError: 'DataFrame' object has no attribute 'value_counts'


That is because ``value_counts()`` is only a method for Series, not DataFrame.

### Task 3.3.8

1. Find the counts of each unique value in the `country` column in the `f500` dataframe.
    - Select the `country` column in the `f500` dataframe. Assign it to a variable named `countries*`
    - Use the `Series.value_counts()` method to return the value counts for `countries`. Assign the results to `country_counts`.

In [22]:
# Start your code below:

countries = f500["country"]
country_counts = countries.value_counts()

## Summary

Below is a summary table of all the different label selection we have learned so far:

|Select by Label|Explicit Syntax|Shorthand Convention|
|-------------|-----------|---------------|
|Single column from dataframe|df.loc[:,"col1"]|df["col1"]|
|List of columns from dataframe|df.loc[:,"col1","col7"]|df["col1","col7"]|
|Single column from dataframe|df.loc[:,"col1":"col4"]| |
|Single row from dataframe| df.loc["row4"]|   |
|List of rows from dataframe |df.loc["row1","row8"]]|  |
|Slice of rows from dataframe|df.loc["row3":"row5"]| df["row3":"row5"]|
|Single item from series|s.loc["item8"]|s["item8"]|
|List of items from series|s.loc[["item1", "item7"]]|s[["item1","item7"]]|
|Slice of items from series|s.loc["item2":"item4"] |s["item2":"item4"]|